classify = {"发散风寒药":    ["麻黄","桂枝","紫苏叶","紫苏梗","生姜","香薷","荆芥","防风","羌活","白芷","细辛","藁本","苍耳子","辛夷","葱白","鹅不食草","胡荽","柽柳"],
"发散风热药":    ["薄荷","牛蒡子","蝉蜕","桑叶","菊花","蔓荆子","柴胡","升麻","葛根","淡豆豉","浮萍","木贼"],
"清热泻火药":    ["石膏","寒水石","知母","芦根","天花粉","竹叶","淡竹叶","鸭跖草","栀子","夏枯草","决明子","谷精草","密蒙花","青箱子"],
"清热燥湿药":    ["黄芩","黄连","黄柏","龙胆","秦皮","苦参","白鲜皮","苦豆子","三颗针","马尾连"],
"清热解毒药":    ["金银花","连翘","穿心莲","大青叶","板蓝根","青黛","贯众","蒲公英","紫花地丁","野菊花","重楼","拳参","漏芦","土茯苓","鱼腥草","金荞麦","大血藤","败酱草","射干","山豆根","马勃","青果","锦灯笼","金果榄","木蝴蝶","白头翁","马齿苋","鸦胆子","地锦草","委陵菜","翻白草","半边莲","白花蛇舌草","山慈菇","熊胆","千里光","白蔹","四季青","绿豆"],
"清热凉血药":    ["生地黄","玄参","牡丹皮","赤芍","紫草","水牛角"],
"清虚热药":     ["青蒿","白薇","地骨皮","银柴胡","胡黄连"],
"攻下药":      ["大黄","芒硝","番泻叶","芦荟"],
"润下药":      ["火麻仁","郁李仁","松子仁"],
"峻下逐水药":    ["甘遂","京大戟","芫花","商陆","牵牛子","巴豆","千金子"],
"祛风寒湿药":    ["独活","威灵仙","川乌","蕲蛇","乌梢蛇","木瓜","蚕沙","伸筋草","寻骨风","松节","海风藤","青风藤","丁公藤","昆明山海棠","雪上一枝蒿","路路通"],
"祛风湿热药":    ["秦艽","防己","桑枝","豨莶草","臭梧桐","海桐皮","络石藤","雷公藤","老鹤草","穿山龙","丝瓜络"],
"祛风湿强筋骨药":  ["五加皮","桑寄生","狗脊","千年健","雪莲花","鹿衔草","石楠叶"],
"化湿药":      ["藿香","佩兰","苍术","厚朴","砂仁","豆蔻","草豆蔻","草果"],
"利水消肿药":    ["茯苓","薏苡仁","猪苓","泽泻","冬瓜皮","玉米须","葫芦","香加皮","枳椇子","泽漆","蝼蛄","荠菜"],
"利尿通淋药":    ["车前子","滑石","木通","通草","瞿麦","萹蓄","地肤子","海金沙","石韦","冬葵子","灯心草","萆薢"],
"利湿退黄药":    ["茵陈","金钱草","虎杖","地耳草","垂盆草","鸡骨草","珍珠草"],
"温里药":      ["附子","干姜","肉桂","吴茱萸","小茴香","丁香","高良姜","胡椒","花椒","荜拨","荜澄茄"],
"理气药":      ["陈皮","青皮","枳实","木香","沉香","檀香","川楝子","乌药","青木香","荔枝核","香附","佛手","香橼","玫瑰花","绿萼梅","娑罗子","薤白","天仙藤","大腹皮","甘松","九香虫","刀豆","柿蒂"],
"消食药":      ["山楂","神曲","麦芽","稻牙","莱菔子","鸡内金","鸡矢藤","隔山消","阿魏"],
"驱虫药":      ["使君子","槟榔","南瓜子","鹤草芽","雷丸","鹤虱","榧子","芜荑"],
"凉血止血药":    ["小蓟","大蓟","地榆","槐花","侧柏叶","白茅根","苎麻根","羊蹄"],
"化瘀止血药":    ["三七","茜草","蒲黄","花蕊石","降香"],
"收敛止血药":    ["白及","仙鹤草","紫珠","棕榈碳","血余炭","藕节","檵木"],
"温经止血药":    ["艾叶","炮姜","灶心土"],
"活血止痛药":    ["川芎","延胡索","郁金","姜黄","乳香","没药","五灵脂","夏天无","枫香脂"],
"活血调经药":    ["丹参","红花","桃仁","益母草","泽兰","牛膝","鸡血藤","王不留行","月季花","凌霄花"],
"活血疗伤药":    ["土鳖虫","马钱子","自然铜","苏木","骨碎补","血竭","儿茶","刘寄奴"],
"破血消癥药":    ["莪术","三棱","水蛭","虻虫","斑蝥","穿山甲"],
"温化寒痰药":    ["半夏","天南星","禹白附","白芥子","皂荚","旋覆花","白前","猫爪草"],
"清热化痰药":    ["川贝母","浙贝母","瓜蒌","竹茹","竹沥","天竺黄","前胡","桔梗","胖大海","海藻","昆布","黄药子","海蛤壳","海浮石","瓦楞子","礞石"],
"止咳平喘药":    ["苦杏仁","紫苏子","百部","紫菀","款冬花","马兜铃","枇杷叶","桑白皮","葶苈子","白果","矮地茶","洋金花","华山参","罗汉果","满山红","胡颓子叶"],
"重镇安神药":    ["朱砂","磁石","龙骨","琥珀"],
"养心安神药":    ["酸枣仁","柏子仁","灵芝","缬草","首乌藤","合欢皮","远至"],
"平抑肝阳药":    ["石决明","珍珠母","牡蛎","紫贝齿","代赭石","刺蒺藜","罗布麻叶","生铁落"],
"息风止痉药":    ["羚羊角","牛黄","珍珠","钩藤","天麻","地龙","全蝎","蜈蚣","僵蚕"],
"开窍药":      ["麝香","冰片","苏合香","石菖蒲"],
"补气药":      ["人参","西洋参","党参","太子参","黄芪","白术","山药","白扁豆","甘草","大枣","刺五加","绞股蓝","红景天","沙棘","饴糖","蜂蜜"],
"补阳药":      ["鹿茸","紫河车","淫羊藿","巴戟天","仙茅","杜仲","续断","肉苁蓉","锁阳","补骨脂","益智仁","菟丝子","沙苑子","蛤蚧","核桃仁","冬虫夏草","胡芦巴","韭菜子","阳起石","紫石英","海狗肾","海马","蛤蟆油","羊红膳"],
"补血药":      ["当归","熟地黄","白芍","阿胶","何首乌","龙眼肉","楮实子"],
"补阴药":      ["北沙参","南沙参","百合","麦冬","天冬","石斛","玉竹","黄精"," 明党参","枸杞子","墨旱莲","女贞子","桑葚","黑芝麻","龟甲","鳖甲"],
"固表止汗药":    ["麻黄根","浮小麦","糯稻根须"],
"敛肺涩肠药":    ["五味子","乌梅","五倍子","罂粟壳","诃子","石榴皮","肉豆蔻","赤石脂","禹余粮"],
"固精缩尿止带药":  ["山茱萸","覆盆子","桑螵蛸","金樱子","海螵蛸","莲子","芡实","刺猬皮","椿皮","鸡冠花"],
"涌吐药":      ["常山","瓜蒂","胆矾"],
"攻毒杀虫去腐敛疮药":["雄黄","硫磺","白矾","蛇床子","蟾酥","樟脑","木鳖子","土荆皮","蜂房","大蒜","升药","轻粉","砒石","铅丹","炉甘石","硼砂"]}





























































































